# Intoduction to Pandas using Jupyter Notebook

# 1. Getting Started with Data Analysis 
### Installation and Loading Data

In [278]:
import pandas as pd

In [279]:
df = pd.read_csv('data/survey_results_schema.csv') # load csv file

In [280]:
df.shape # Display rows and columns of csv

(85, 2)

In [281]:
df.head(5) # Display first 5 rows

        Column                                       QuestionText
0   Respondent  Randomized respondent ID number (not in order ...
1   MainBranch  Which of the following options best describes ...
2     Hobbyist                            Do you code as a hobby?
3  OpenSourcer        How often do you contribute to open source?
4   OpenSource  How do you feel about the quality of open sour...

In [282]:
df.tail(5) # Display last 5 rows

          Column                                       QuestionText
80     Sexuality  Which of the following do you currently identi...
81     Ethnicity  Which of the following do you identify as? Ple...
82    Dependents  Do you have any dependents (e.g., children, el...
83  SurveyLength  How do you feel about the length of the survey...
84    SurveyEase  How easy or difficult was this survey to compl...

In [283]:
pd.set_option('display.max_rows', 85) # Display all rows

# 2. DataFrames and Series Basics
### Selecting Rows and Columns

In [284]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [285]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [286]:
df = pd.DataFrame(people)

In [287]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [288]:
df['email'] # iterator, since columns = 1

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [289]:
type(df['email'])

pandas.core.series.Series

In [290]:
df.email # Careful with names

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [291]:
df[['email', 'last']] # data frame, since columns > 1

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe
2        JohnDoe@email.com      Doe

In [292]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [293]:
df.iloc[0] # integer location - first row

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [294]:
df.iloc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [295]:
df.iloc[[0, 1], 2]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [296]:
df.loc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [297]:
df.loc[[0, 1], 'email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [298]:
df.loc[[0, 1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

# 3. Indexes
### How to Set, Reset, and Use Indexes

In [299]:
df.set_index('email') #returns new DataFrame

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [300]:
df # No change

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [301]:
df.set_index('email', inplace = True) # inplace will change the actual DataFrame

In [302]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [303]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com'], dtype='object', name='email')

In [304]:
df.loc['CoreyMSchafer@gmail.com']

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [305]:
df.loc['CoreyMSchafer@gmail.com', 'last']

'Schafer'

In [306]:
#df.loc[0] will now cause error, since there is no 0 index

In [307]:
df.iloc[0] # iloc still uses indexes however

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [308]:
df.reset_index(inplace=True)
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

# 4. Filtering
### Using Conditionals to Filter Rows and Columns

In [309]:
filt = (df['last'] == 'Doe')

In [310]:
filt

0    False
1     True
2     True
Name: last, dtype: bool

In [311]:
df[filt] #df[df['last'] == 'Doe']

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [312]:
df.loc[filt]

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [313]:
df.loc[filt, 'email']

1    JaneDoe@email.com
2    JohnDoe@email.com
Name: email, dtype: object

In [314]:
filt2 = (df['last'] == 'Doe') & (df['first'] == 'John') 
filt3 = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [315]:
df.loc[filt2]

               email first last
2  JohnDoe@email.com  John  Doe

In [316]:
df.loc[filt3]

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
2        JohnDoe@email.com   John      Doe

In [317]:
df.loc[~filt3] # "~" (tilda) inverses condition simmilar to "!"

               email first last
1  JaneDoe@email.com  Jane  Doe

# 5. Updating Rows and Columns 
### Modifying Data Within DataFrames

In [318]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [319]:
df.columns = ['email', 'first_name', 'last_name']

In [320]:
df.columns = [x.upper() for x in df.columns]
df

                     EMAIL FIRST_NAME LAST_NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe

In [321]:
df.columns.str.replace('_', '  ')

Index(['EMAIL', 'FIRST  NAME', 'LAST  NAME'], dtype='object')

In [322]:
df.rename(columns={'FIRST_NAME': 'first', 'LAST_NAME': 'last', 'EMAIL': 'email'}, inplace=True)
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [323]:
df.loc[2] = ['new@email.org', 'John', 'Smith']
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2            new@email.org   John    Smith

In [324]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [325]:
df.loc[2, 'last'] = 'Smith'
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John    Smith

In [326]:
df.at[2, 'last'] = 'Doe' # Same as df.loc[2, 'last']
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

### Apply()

In [327]:
 df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [328]:
def update_email(email):
    return email.upper()

In [329]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [330]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [331]:
df['email'] = df['email'].apply(update_email)
df

                     email  first     last
0  COREYMSCHAFER@GMAIL.COM  Corey  Schafer
1        JANEDOE@EMAIL.COM   Jane      Doe
2        JOHNDOE@EMAIL.COM   John      Doe

In [332]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

                     email  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@email.com   Jane      Doe
2        johndoe@email.com   John      Doe

In [333]:
df.apply(len) # applying len to each series - there is 3 rows

email    3
first    3
last     3
dtype: int64

In [334]:
len(df['email']) # there is 3 emails

3

In [335]:
df.apply(len, axis='columns') # same as df.apply(len)

0    3
1    3
2    3
dtype: int64

In [336]:
df.apply(pd.Series.min) # minimum values in each series(alphabetical order)

email    coreymschafer@gmail.com
first                      Corey
last                         Doe
dtype: object

In [337]:
df.apply(lambda x: x.min()) # same as df.apply(pd.Series.min)

email    coreymschafer@gmail.com
first                      Corey
last                         Doe
dtype: object

### applymap( )

In [338]:
df.applymap(len) # apply method to each element

   email  first  last
0     23      5     7
1     17      4     3
2     17      4     3

In [339]:
df.applymap(str.lower)

                     email  first     last
0  coreymschafer@gmail.com  corey  schafer
1        janedoe@email.com   jane      doe
2        johndoe@email.com   john      doe

### map( )

In [340]:
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

### replace( )

In [341]:
df['first'] = df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})
df

                     email  first     last
0  coreymschafer@gmail.com  Chris  Schafer
1        janedoe@email.com   Mary      Doe
2        johndoe@email.com   John      Doe

# Add/Remove Rows and Columns From DataFrames

In [342]:
df['full_name'] = df['first'] + ' ' + df['last']
df

                     email  first     last      full_name
0  coreymschafer@gmail.com  Chris  Schafer  Chris Schafer
1        janedoe@email.com   Mary      Doe       Mary Doe
2        johndoe@email.com   John      Doe       John Doe

In [343]:
df.drop(columns=['first', 'last'], inplace = True)
df

                     email      full_name
0  coreymschafer@gmail.com  Chris Schafer
1        janedoe@email.com       Mary Doe
2        johndoe@email.com       John Doe

In [344]:
df['full_name'].str.split(expand = True)

       0        1
0  Chris  Schafer
1   Mary      Doe
2   John      Doe

In [345]:
df[['first', 'last']] = df['full_name'].str.split(expand = True)
df

                     email      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com       John Doe   John      Doe

In [346]:
df.append({'first': 'Tony'}, ignore_index=True)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [347]:
people = {
    "first": ["Tony", 'Jack'], 
    "last": ["Stark", 'Johnson'], 
    "email": ["tonystark@avenge.com", 'jackjohnson@email.com']
}
df2 = pd.DataFrame(people)

In [348]:
df2

  first     last                  email
0  Tony    Stark   tonystark@avenge.com
1  Jack  Johnson  jackjohnson@email.com

In [349]:
df = df.append(df2, ignore_index=True)
df

                     email      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com       John Doe   John      Doe
3     tonystark@avenge.com            NaN   Tony    Stark
4    jackjohnson@email.com            NaN   Jack  Johnson

In [351]:
df.drop(index=4, inplace=True)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com       John Doe   John      Doe
3     tonystark@avenge.com            NaN   Tony    Stark

In [355]:
filt = (df['last'] == 'Doe')
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
3     tonystark@avenge.com            NaN   Tony    Stark
4    jackjohnson@email.com            NaN   Jack  Johnson

# Sorting Data

In [362]:
df.sort_values(by='last')

                     email      full_name  first     last
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com       John Doe   John      Doe
4    jackjohnson@email.com            NaN   Jack  Johnson
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
3     tonystark@avenge.com            NaN   Tony    Stark

In [363]:
df.sort_values(by=['last', 'first'], ascending=False)

                     email      full_name  first     last
3     tonystark@avenge.com            NaN   Tony    Stark
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
4    jackjohnson@email.com            NaN   Jack  Johnson
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com       John Doe   John      Doe

In [365]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)

In [366]:
df.sort_index()

                     email      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
1        janedoe@email.com       Mary Doe   Mary      Doe
2        johndoe@email.com       John Doe   John      Doe
3     tonystark@avenge.com            NaN   Tony    Stark
4    jackjohnson@email.com            NaN   Jack  Johnson

In [377]:
df['last'].sort_values()

2        Doe
1        Doe
4    Johnson
0    Schafer
3      Stark
Name: last, dtype: object

# Cleaning Data 
### Casting Datatypes and Handling Missing Values

In [378]:
import numpy as np

In [379]:
df.dropna() # default values - df.dropna(axis='index', how='any')

                     email      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
2        johndoe@email.com       John Doe   John      Doe
1        janedoe@email.com       Mary Doe   Mary      Doe

In [380]:
df.dropna(axis='index', how='all') # drop any indexes(rows) that have every values = NaN

                     email      full_name  first     last
3     tonystark@avenge.com            NaN   Tony    Stark
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
4    jackjohnson@email.com            NaN   Jack  Johnson
2        johndoe@email.com       John Doe   John      Doe
1        janedoe@email.com       Mary Doe   Mary      Doe

In [381]:
df.dropna(axis='columns', how='any') # drop any columns tha have every values = NaN

                     email  first     last
3     tonystark@avenge.com   Tony    Stark
0  coreymschafer@gmail.com  Chris  Schafer
4    jackjohnson@email.com   Jack  Johnson
2        johndoe@email.com   John      Doe
1        janedoe@email.com   Mary      Doe

In [382]:
df.dropna(axis='index', how='any', subset=['full_name', 'first']) # remove rows that have NaN in 'full_name' or 'first'

                     email      full_name  first     last
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
2        johndoe@email.com       John Doe   John      Doe
1        janedoe@email.com       Mary Doe   Mary      Doe

In [384]:
df.replace(np.nan, 'missing')

                     email      full_name  first     last
3     tonystark@avenge.com        missing   Tony    Stark
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
4    jackjohnson@email.com        missing   Jack  Johnson
2        johndoe@email.com       John Doe   John      Doe
1        janedoe@email.com       Mary Doe   Mary      Doe

In [390]:
df.fillna(0) # simmilar to df.replace(np.nan, 0)

                     email      full_name  first     last
3     tonystark@avenge.com              0   Tony    Stark
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
4    jackjohnson@email.com              0   Jack  Johnson
2        johndoe@email.com       John Doe   John      Doe
1        janedoe@email.com       Mary Doe   Mary      Doe

In [391]:
df

                     email      full_name  first     last
3     tonystark@avenge.com            NaN   Tony    Stark
0  coreymschafer@gmail.com  Chris Schafer  Chris  Schafer
4    jackjohnson@email.com            NaN   Jack  Johnson
2        johndoe@email.com       John Doe   John      Doe
1        janedoe@email.com       Mary Doe   Mary      Doe

In [392]:
df.isna()

   email  full_name  first   last
3  False       True  False  False
0  False      False  False  False
4  False       True  False  False
2  False      False  False  False
1  False      False  False  False

In [397]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}
df2 = pd.DataFrame(people)

df2.replace('NA', np.nan, inplace=True)
df2.replace('Missing', np.nan, inplace=True)

df2

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [399]:
df2['age'] = df2['age'].astype(float)

In [400]:
df2.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [402]:
df2['age'].mean()

46.75